; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	spectrograph3 - mode
	image4 - mode
	spectrograph2 - mode
	thermograph8 - mode
	spectrograph1 - mode
	image7 - mode
	infrared5 - mode
	infrared0 - mode
	spectrograph6 - mode
	Star2 - direction
	Star5 - direction
	Star4 - direction
	Star1 - direction
	GroundStation3 - direction
	Star0 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 image7)
	(calibration_target instrument0 Star5)
	(supports instrument1 image7)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star2)
	(supports instrument2 infrared0)
	(supports instrument2 thermograph8)
	(supports instrument2 image4)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument3 image4)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 Star0)
	(supports instrument4 infrared0)
	(supports instrument4 image7)
	(supports instrument4 thermograph8)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument5 infrared5)
	(supports instrument5 spectrograph1)
	(supports instrument5 spectrograph6)
	(supports instrument5 spectrograph2)
	(supports instrument5 spectrograph3)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 Star1)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
	(supports instrument6 spectrograph1)
	(supports instrument6 infrared0)
	(supports instrument6 image7)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon6)
	(supports instrument7 image4)
	(supports instrument7 thermograph8)
	(calibration_target instrument7 Star0)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon6)
)
(:goal (and
	(pointing satellite0 Planet10)
	(pointing satellite1 Star5)
	(pointing satellite3 GroundStation3)
	(have_image Phenomenon6 image4)
	(have_image Phenomenon6 infrared0)
	(have_image Phenomenon6 spectrograph3)
	(have_image Star7 infrared0)
	(have_image Star8 spectrograph2)
	(have_image Star8 image7)
	(have_image Phenomenon9 infrared0)
	(have_image Phenomenon9 spectrograph2)
	(have_image Phenomenon9 spectrograph3)
	(have_image Planet10 thermograph8)
	(have_image Planet10 spectrograph1)
))

)

; plan
1. (turn_to satellite3 groundstation3 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 groundstation3)
   goals met: 1 of 14
2. (turn_to satellite2 star0 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 star0)
   goals met: 1 of 14
3. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 1 of 14
4. (calibrate satellite2 instrument5 star0)
   added: (calibrated instrument5)
   goals met: 1 of 14
5. (turn_to satellite2 phenomenon9 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon9)
   goals met: 1 of 14
6. (take_image satellite2 phenomenon9 instrument5 spectrograph3)
   added: (have_image phenomenon9 spectrograph3)
   goals met: 2 of 14
7. (take_image satellite2 phenomenon9 instrument5 spectrograph2)
   added: (have_image phenomenon9 spectrograph2)
   goals met: 3 of 14
8. (turn_to satellite2 phenomenon6 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 phenomenon6)
   goals met: 3 of 14
9. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   goals met: 3 of 14
10. (take_image satellite2 phenomenon6 instrument5 spectrograph3)
   added: (have_image phenomenon6 spectrograph3)
   goals met: 4 of 14
11. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 4 of 14
12. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 4 of 14
13. (calibrate satellite1 instrument4 star4)
   added: (calibrated instrument4)
   goals met: 4 of 14
14. (calibrate satellite0 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 4 of 14
15. (turn_to satellite0 phenomenon6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 14
16. (take_image satellite0 phenomenon6 instrument2 image4)
   added: (have_image phenomenon6 image4)
   goals met: 5 of 14
17. (take_image satellite0 phenomenon6 instrument2 infrared0)
   added: (have_image phenomenon6 infrared0)
   goals met: 6 of 14
18. (turn_to satellite0 phenomenon9 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon9)
   goals met: 6 of 14
19. (take_image satellite0 phenomenon9 instrument2 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 7 of 14
20. (turn_to satellite0 planet10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet10)
   goals met: 8 of 14
21. (take_image satellite0 planet10 instrument2 thermograph8)
   added: (have_image planet10 thermograph8)
   goals met: 9 of 14
22. (turn_to satellite1 star7 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star7)
   goals met: 9 of 14
23. (take_image satellite1 star7 instrument4 infrared0)
   added: (have_image star7 infrared0)
   goals met: 10 of 14
24. (turn_to satellite1 star8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star8)
   goals met: 10 of 14
25. (take_image satellite1 star8 instrument4 image7)
   added: (have_image star8 image7)
   goals met: 11 of 14
26. (turn_to satellite1 star5 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star5)
   goals met: 12 of 14
27. (turn_to satellite2 planet10 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 planet10)
   goals met: 12 of 14
28. (take_image satellite2 planet10 instrument5 spectrograph1)
   added: (have_image planet10 spectrograph1)
   goals met: 13 of 14
29. (turn_to satellite2 star8 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 star8)
   goals met: 13 of 14
30. (take_image satellite2 star8 instrument5 spectrograph2)
   added: (have_image star8 spectrograph2)
   goals met: 14 of 14
